org-posts/foldr-infinite-list-haskell.org
#+setupfile: ../static/org-templates/level-1.org
#+title: Understanding why foldr works on infinite list on Haskell
#+date: <2021-05-28 Fri>
#+category: haskell
#+DESCRIPTION: Foldr can work on infinite list, whereas foldl don't, lets dive into why that's the case

I started learning Haskell this year, and I started reading a well known book, [[http://learnyouahaskell.com][learnyouahaskell.com]]. But while reading through the [[http://learnyouahaskell.com/higher-order-functions#folds][High order functions chapter]] I came across a snipped of code that could not fully understand.

