org-posts/foldr-infinite-list-haskell.org
* Implement head function using foldr1

#+begin_src haskell :exports both :results output verbatim code
head' :: [a] -> a
head' = foldr1 (\x _ -> x)
#+end_src

For those who don't know, =foldr1= is just a short hand of =foldr= that already take the last element as accumulator or starting point for the =fold=. So, this snipped =foldr1 (\_ acc -> acc) [1..10]= would return =10=

After struggling a while trying to understand why the above =head'= function will work on infinite lists like this one:

#+begin_src haskell :exports both :results output verbatim code
head' [1..]
#+end_src

#+RESULTS:
#+begin_src haskell
1
#+end_src

but its =foldl= equivalent won't, it will run for ever:

#+begin_src haskell :exports both :results output verbatim code
head' = foldl1 (\_ x -> x)
#+end_src

I decided to [[https://stackoverflow.com/questions/67558977/foldr1-and-infinite-list-on-haskell][ask on stack overflow]] and that actually helped me understand why it was working, but I wanted to go a little bit deeper and continued to search. After reading through all the answers in [[https://stackoverflow.com/q/1757740/1612432][this question]] that mentioned /infinite list/, I found the one that [[https://stackoverflow.com/a/63177677/1612432][enlightened me]]. I will try to explain what I understood in order to help others with the same question, but also to exercise my understanding and why not, for my future me.

*NOTE*: I'm not a Haskell expert, so if I say something wrong, feel free to correct me in the comments below.

