org-posts/foldr-infinite-list-haskell.org
* How foldr works from the inside

foldr implementation can be seen [[https://hackage.haskell.org/package/base-4.10.0.0/docs/src/GHC.Base.html#foldr][here]]:

#+begin_src haskell :exports both :results output verbatim code
foldr k z = go
          where
            go []     = z
            go (y:ys) = y `k` go ys
#+end_src

A common misunderstanding with =foldr= and =foldl=, which I also had, is that one may think the former start from the end of the list, and the latter from the begining. What really happens is that =foldl= is left associative, and =foldr= right associative, and *both of them start from the left most side* of the list.

With this knowledge, and the implementation of =foldr=, we can finally understand what is going under the hood in our =head'= function. Lets write our lambda function as a regular function to make it easier:

#+begin_src haskell :exports both :results output verbatim code
myL x _ = x
#+end_src

Simple enough, a function that takes two arguments and just returns the first one. Now, lets see how this piece of code would evaluate:

#+begin_src haskell :exports both :results output verbatim code
foldr1 myL [1..]
#+end_src

#+RESULTS:
#+begin_src haskell
1
#+end_src

As we are providing a non-empty list, the pattern match would go to the second pattern, evaluating to

#+begin_src haskell :exports both :results output verbatim code
1 `myL` go ys
#+end_src

Since Haskell is lazy, and our =myL= function already have all it needs (the first element of the list) there is no need to evaluate the second side of the statement, namely =go ys=, so we have short-circuited =foldr= and it returns with the correct result, the head of the infinite list.

* Conclusion

This may be a simple thing to understand, but it wasn't entirely clear to me why it was working until I dived enough into the code to finally understand it correctly. Hope it was helpful for you also!

Feel free to comment if you feel something can be improved.
