org-posts/foldr-infinite-list-haskell.html
</pre></div><p>A common misunderstanding with <code>foldr</code> and <code>foldl</code>, which I also had, is that one may think the former start from the end of the list, and the latter from the begining. What really happens is that <code>foldl</code> is left associative, and <code>foldr</code> right associative, and <b>both of them start from the left most side</b> of the list.<p>With this knowledge, and the implementation of <code>foldr</code>, we can finally understand what is going under the hood in our <code>head'</code> function. Lets write our lambda function as a regular function to make it easier:<div class="org-src-container"><pre class="src src-haskell">myL x _ = x
</pre></div><p>Simple enough, a function that takes two arguments and just returns the first one. Now, lets see how this piece of code would evaluate:<div class="org-src-container"><pre class="src src-haskell">foldr1 myL [1..]
</pre></div><div class="org-src-container"><pre class="src src-haskell">1
</pre></div><p>As we are providing a non-empty list, the pattern match would go to the second pattern, evaluating to<div class="org-src-container"><pre class="src src-haskell">1 `myL` go ys
</pre></div><p>Since Haskell is lazy, and our <code>myL</code> function already have all it needs (the first element of the list) there is no need to evaluate the second side of the statement, namely <code>go ys</code>, so we have short-circuited <code>foldr</code> and it returns with the correct result, the head of the infinite list.</div></div><div id="outline-container-org5e8ec39"class="outline-2"><h2 id="org5e8ec39">Conclusion</h2><div class="outline-text-2"id="text-org5e8ec39"><p>This may be a simple thing to understand, but it wasn't entirely clear to me why it was working until I dived enough into the code to finally understand it correctly. Hope it was helpful for you also!<p>Feel free to comment if you feel something can be improved.</div></div></div><div id="postamble"class="status"><p class="author">Author: Alejandro Alcalde<p class="date">Date: 2021-05-28 Fri 00:00<p class="creator">Emacs 26.3 (Org mode 9.3.6)<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a><p><a href="/theindex.html">Index</a><p><script src="https://utteranc.es/client.js"repo="elbaulp/elbaulp.github.io"issue-term="title"label="💬 Comment"theme="github-light"crossorigin="anonymous"async></script></div>